//JAVAC    EXEC JAVAC,
// JAVACLS='''SmfSearch''',
// SRCPATH='''java/src''',
// TGTPATH='''java/target''',
// JAVACOPT='''-Xlint -verbose''',
// CLASPATH='''java/easysmf-je-1-8-0/jar/*'''
