//JAVAG    EXEC PROC=JAVAG,
// JAVACLS='''SmfSearch''',
// CLASPATH='''java/easysmf-je-1-8-0/jar/*'''
//INPUT    DD DISP=SHR,DSN=MVS1.SMF.RECORDS
//EZSMFKEY DD DISP=SHR,DSN=ANDREWR.EASYSMF.INSTALL(EZSMFK)
